// This file can be used as an alternate way to configure ATAKLite. If defined, all standard settings will be ignored!
//
// It should be placed in your android home directory (The one with the DCIM, Android, Movies, Music, etc. folders).
// "adb push ATAKLite-Config.json /sdcard/" is one way of doing so
// If you would like to override the location provider on a default client build, please see the "LocationProviderSimulated.json" file.
{
  // The callsign/identifier to identify yourself to the server
  "callsign" : "Default Callsign",
  // Indicates if periodic SA messages should be automatically sent to the server
  "broadcastSA" : true,
  // The LatestSA Broadcast interval in milliseconds
  "latestSABroadcastIntervalMS" : 1000,
  // The LatestSA Broadcast delay in milliseconds
  "latestSABroadcastDelayMS" : 1000,
  // If both imageBroadcast settings are defined and valid, the sample image will be sent at periodic intervals to the server
  // The interval to broadcast images at. A null or 0 value will indicate none should be sent
  "imageBroadcastIntervalMS" : 10000,
  // The initial delay before sending the image. Must not be null.
  "imageBroadcastDelayMS" : 0,
  // Overrides the user interface (May cause undesirable behavior if set to GoogleMaps on an unsupported device)
  // Options supported: "Default", "GoogleMaps", "ListView"
  "userInterface" : "ListView",
  // Whether or not to log received location updates
  "logReceivedLocationUpdates" : true,
  // Whether or not to log own location updates
  "logOwnLocationUpdates" : true,
  // Whether or not to attempt to load previously saved location updates on startup
  "loadReceivedLocationUpdatesFromLog" : true,
  // Whether or not to attempt to load own previously saved location updates on startup
  "loadOwnLocationUpdatesFromLog" : true,
  // The storage path for saved location updates
  "locationLogExternalStoragePath" : "ataklite/LocationLog.json",
  // Server configuration details
  "serverConfig" : {
    // The URL of the server to connect to
    "url" : "127.0.0.1",
    // The port to connect to
    "port" : 8088
  },
  // The configuration settings for analytics.
  "analyticsConfig" : {
    // The Target.
    // Options supported:
    //    "DEFAULT" - The default platform analytics, Which is Log.i("ImmortalsAnalytics", <data.) in this case.
    //    "STDOUT" - Standard Output
    //    "NET_LOG4J - Log4j server. If selected, a url and port must be specified.
    "target" : "DEFAULT",
    // The verbosity of the logging
    // Options supported:
    //    "Metadata" - Bare event data such as event identifier, source, and remote source
    //    "Data" - Bare event data with the associated object (such as coordinates) serialized to JSON, if any.
    "verbosity" : "Data",
    // The URL for network logging targets
    "url" : "127.0.0.1",
    // The port for network logging targets
    "port" : 7707
  }
}
